hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/log/src/nrf_log_frontend.c
            }
            
            nrf_log_module_dynamic_data_t *p_module_ddata = NRF_LOG_DYNAMIC_SECTION_VARS_GET(i);
            p_module_ddata->order_idx = idx;
        }
        
        /* Initialize filters */
        for(i = 0; i < modules_cnt; i++)
        {
            nrf_log_module_dynamic_data_t *p_module_ddata = NRF_LOG_DYNAMIC_SECTION_VARS_GET(i);
            nrf_log_module_filter_data_t *p_module_filter = NRF_LOG_FILTER_SECTION_VARS_GET(i);
            p_module_ddata->filter = 0;
            p_module_filter->filter_lvls = 0;
        }
    }
    
    return NRF_SUCCESS;
}

uint32_t nrf_log_module_cnt_get(void)
{
    return NRF_LOG_CONST_SECTION_VARS_COUNT;
}

static ret_code_t module_idx_get(uint32_t *p_idx, bool ordered_idx)
{
    if(ordered_idx)
    {
        uint32_t module_cnt = nrf_log_module_cnt_get();
        uint32_t i;
        
        for(i = 0; i < module_cnt; i++)
        {
            nrf_log_module_dynamic_data_t *p_module_data = NRF_LOG_DYNAMIC_SECTION_VARS_GET(i);
            
            if(p_module_data->order_idx == *p_idx)
            {
                *p_idx = i;
                return NRF_SUCCESS;
            }
        }
        
        return NRF_ERROR_NOT_FOUND;
    }
    
    else
        return NRF_SUCCESS;
}
const char *nrf_log_module_name_get(uint32_t module_id, bool ordered_idx)
{
    if(module_idx_get(&module_id, ordered_idx) == NRF_SUCCESS)
    {
        nrf_log_module_const_data_t *p_module_data = NRF_LOG_CONST_SECTION_VARS_GET(module_id);
        return p_module_data->p_module_name;
    }
    
    else
        return NULL;
}

uint8_t nrf_log_color_id_get(uint32_t module_id, nrf_log_severity_t severity)
{
    nrf_log_module_const_data_t *p_module_data = NRF_LOG_CONST_SECTION_VARS_GET(module_id);
    uint8_t color_id;
    
    switch(severity)
    {
        case NRF_LOG_SEVERITY_ERROR:
            color_id = NRF_LOG_ERROR_COLOR;
            break;
            
        case NRF_LOG_SEVERITY_WARNING:
            color_id = NRF_LOG_WARNING_COLOR;
            break;
            
        case NRF_LOG_SEVERITY_INFO:
            color_id = p_module_data->info_color_id;
            break;
            
        case NRF_LOG_SEVERITY_DEBUG:
            color_id = p_module_data->debug_color_id;
            break;
            
        default:
            color_id = 0;
            break;
    }
    
    return color_id;
}

static uint16_t higher_lvl_get(uint32_t lvls)
{
    uint16_t top_lvl = 0;
    uint16_t tmp_lvl;
    uint32_t i;
    
    //Find highest level enabled by backends
    for(i = 0; i < (32 / NRF_LOG_LEVEL_BITS); i += NRF_LOG_LEVEL_BITS)
    {
        tmp_lvl = (uint16_t)BF_GET(lvls, NRF_LOG_LEVEL_BITS, i);
        
        if(tmp_lvl > top_lvl)
            top_lvl = tmp_lvl;
    }
    
    return top_lvl;
}

void nrf_log_module_filter_set(uint32_t backend_id, uint32_t module_id, nrf_log_severity_t severity)
{
    if(NRF_LOG_FILTERS_ENABLED)
    {
        nrf_log_module_dynamic_data_t *p_module_data = NRF_LOG_DYNAMIC_SECTION_VARS_GET(module_id);
        nrf_log_module_filter_data_t   *p_filter      = NRF_LOG_FILTER_SECTION_VARS_GET(module_id);
        
        p_filter->filter_lvls &= ~BF_MASK(NRF_LOG_LEVEL_BITS, (NRF_LOG_LEVEL_BITS * backend_id));
        p_filter->filter_lvls |= BF_VAL(severity, NRF_LOG_LEVEL_BITS, (NRF_LOG_LEVEL_BITS * backend_id));
        
        p_module_data->filter = higher_lvl_get(p_filter->filter_lvls);
    }
}

static nrf_log_severity_t nrf_log_module_init_filter_get(uint32_t module_id)
{
    nrf_log_module_const_data_t *p_module_data =
        NRF_LOG_CONST_SECTION_VARS_GET(module_id);
    return NRF_LOG_FILTERS_ENABLED ? p_module_data->initial_lvl : p_module_data->compiled_lvl;
}

nrf_log_severity_t nrf_log_module_filter_get(uint32_t backend_id,
                                             uint32_t module_id,
                                             bool ordered_idx,
                                             bool dynamic)
{
    nrf_log_severity_t severity = NRF_LOG_SEVERITY_NONE;
    
    if(NRF_LOG_FILTERS_ENABLED && dynamic)
    {
        if(module_idx_get(&module_id, ordered_idx) == NRF_SUCCESS)
        {
            nrf_log_module_filter_data_t *p_filter = NRF_LOG_FILTER_SECTION_VARS_GET(module_id);
            severity = (nrf_log_severity_t)BF_GET(p_filter->filter_lvls,
                                                  NRF_LOG_LEVEL_BITS,
                                                  (backend_id * NRF_LOG_LEVEL_BITS));
        }
    }
    
    else if(!dynamic)
    {
        if(module_idx_get(&module_id, ordered_idx) == NRF_SUCCESS)
        {
            nrf_log_module_const_data_t *p_module_data =
                NRF_LOG_CONST_SECTION_VARS_GET(module_id);
            severity = (nrf_log_severity_t)p_module_data->compiled_lvl;
        }
    }
    
    return severity;
}
/**
    Function examines current header and omits packets which are in progress.
*/
static bool invalid_packets_omit(nrf_log_header_t const *p_header, uint32_t *p_rd_idx)
{
    bool ret = false;
    
    if(p_header->base.generic.in_progress == 1)
    {
        switch(p_header->base.generic.type)
        {
            case HEADER_TYPE_STD:
                *p_rd_idx += (HEADER_SIZE + p_header->base.std.nargs);
                break;
                
            case HEADER_TYPE_HEXDUMP:
                *p_rd_idx += (HEADER_SIZE + p_header->base.hexdump.len);
                break;
                
            default:
                break;
        }
        
        ret = true;
    }
    
    return ret;
}
/**
    @brief Skips the oldest, not processed logs to make space for new logs.
    @details This function moves forward read index to prepare space for new logs.
*/

static uint32_t log_skip(void)
{
    uint16_t dropped = 0;
    
    (void)nrf_atomic_flag_set(&m_log_data.log_skipped);
    (void)nrf_atomic_flag_set(&m_log_data.log_skipping);
    
    uint32_t           rd_idx = m_log_data.rd_idx;
    uint32_t           mask   = m_log_data.mask;
    nrf_log_header_t *p_header = (nrf_log_header_t *)&m_log_data.buffer[rd_idx & mask];
    nrf_log_header_t   header;
    
    // Skip packets that may be invalid (interrupted while being in progress)
    do
    {
        if(invalid_packets_omit(p_header, &rd_idx))
        {
            //something was omitted. Point to new header and try again.
            p_header = (nrf_log_header_t *)&m_log_data.buffer[rd_idx & mask];
        }
        
        else
            break;
    } while(true);
    
    uint32_t i;
    
    for(i = 0; i < HEADER_SIZE; i++)
        ((uint32_t *)&header)[i] = m_log_data.buffer[rd_idx++ & mask];
        
    switch(header.base.generic.type)
    {
        case HEADER_TYPE_HEXDUMP:
            dropped = header.dropped;
            rd_idx += CEIL_DIV(header.base.hexdump.len, sizeof(uint32_t));
            break;
            
        case HEADER_TYPE_STD:
            dropped = header.dropped;
            rd_idx += header.base.std.nargs;
            break;
            
        default:
            ASSERT(false);
            break;
    }
    
    uint32_t log_skipping_tmp = nrf_atomic_flag_clear_fetch(&m_log_data.log_skipping);
    
