hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/log/src/nrf_log_frontend.c
    //update read index only if log_skip was not interrupted by another log skip
    if(log_skipping_tmp)
        m_log_data.rd_idx = rd_idx;
        
    return (uint32_t)dropped;
}

/**
    @brief Function for getting number of dropped logs. Dropped counter is reset after reading.

    @return Number of dropped logs saturated to 16 bits.
*/
static inline uint32_t dropped_sat16_get(void)
{
    uint32_t dropped = nrf_atomic_u32_fetch_store(&m_log_data.log_dropped_cnt, 0);
    return __USAT(dropped, 16); //Saturate to 16 bits
}


static inline void std_header_set(uint32_t severity_mid,
                                  char const *const p_str,
                                  uint32_t nargs,
                                  uint32_t wr_idx,
                                  uint32_t mask)
{


    //Prepare header - in reverse order to ensure that packet type is validated (set to STD as last action)
    uint32_t module_id = severity_mid >> NRF_LOG_MODULE_ID_POS;
    uint32_t dropped   = dropped_sat16_get();
    ASSERT(module_id < nrf_log_module_cnt_get());
    m_log_data.buffer[(wr_idx + 1) & mask] = module_id | (dropped << 16);
    
    if(NRF_LOG_USES_TIMESTAMP)
        m_log_data.buffer[(wr_idx + 2) & mask] = m_log_data.timestamp_func();
        
    nrf_log_header_t *p_header    = (nrf_log_header_t *)&m_log_data.buffer[wr_idx & mask];
    p_header->base.std.severity    = severity_mid & NRF_LOG_LEVEL_MASK;
    p_header->base.std.nargs       = nargs;
    p_header->base.std.addr        = ((uint32_t)(p_str) & STD_ADDR_MASK);
    p_header->base.std.type        = HEADER_TYPE_STD;
    p_header->base.std.in_progress = 0;
}

/**
    @brief Allocates chunk in a buffer for one entry and injects overflow if
    there is no room for requested entry.

    @param content_len   Number of 32bit arguments. In case of allocating for hex dump it
                        is the size of the buffer in 32bit words (ceiled).
    @param p_wr_idx      Pointer to write index.

    @return True if successful allocation, false otherwise.

*/
static inline bool buf_prealloc(uint32_t content_len, uint32_t *p_wr_idx, bool std)
{
    uint32_t req_len = content_len + HEADER_SIZE;
    bool     ret            = true;
    CRITICAL_REGION_ENTER();
    *p_wr_idx = m_log_data.wr_idx;
    uint32_t available_words = (m_log_data.mask + 1) - (m_log_data.wr_idx - m_log_data.rd_idx);
    
    while(req_len > available_words)
    {
        UNUSED_RETURN_VALUE(nrf_atomic_u32_add(&m_log_data.log_dropped_cnt, 1));
        
        if(NRF_LOG_ALLOW_OVERFLOW)
        {
            uint32_t dropped_in_skip = log_skip();
            UNUSED_RETURN_VALUE(nrf_atomic_u32_add(&m_log_data.log_dropped_cnt, dropped_in_skip));
            available_words = (m_log_data.mask + 1) - (m_log_data.wr_idx - m_log_data.rd_idx);
        }
        
        else
        {
            ret = false;
            break;
        }
    }
    
    if(ret)
    {
        nrf_log_main_header_t invalid_header;
        invalid_header.raw = 0;
        
        if(std)
        {
            invalid_header.std.type        = HEADER_TYPE_STD;
            invalid_header.std.in_progress = 1;
            invalid_header.std.nargs       = content_len;
        }
        
        else
        {
            invalid_header.hexdump.type = HEADER_TYPE_HEXDUMP;
            invalid_header.hexdump.in_progress = 1;
            invalid_header.hexdump.len = content_len;
        }
        
        nrf_log_main_header_t *p_header =
            (nrf_log_main_header_t *)&m_log_data.buffer[m_log_data.wr_idx & m_log_data.mask];
            
        p_header->raw = invalid_header.raw;
        
        m_log_data.wr_idx += req_len;
    }
    
    CRITICAL_REGION_EXIT();
    return ret;
}

char const *nrf_log_push(char *const p_str)
{
    if((m_log_data.autoflush) || (p_str == NULL))
        return p_str;
        
    size_t ssize = strlen(p_str) + 1; // + 1 for null termination
    uint8_t *p_dst;
    
    // Allocate space in the ring buffer. It may be smaller than the requested string in case of buffer wrapping or when the ring buffer size is too small.
    // Once the string is copied into the buffer, the space is immediately freed. The string is kept in the buffer but can be overwritten.
    // It is done that way because there is no other place where space could be freed since string processing happens in
    // the logger backends, often by modules which are generic and not aware of internals of the logger.
    if(nrf_ringbuf_alloc(&m_log_push_ringbuf, &p_dst, &ssize, true) == NRF_SUCCESS)
    {
        ret_code_t err;
        
        memcpy(p_dst, p_str, ssize);
        
        //Terminate in case string was partial.
        p_dst[ssize - 1] = '\0';
        
        err = nrf_ringbuf_put(&m_log_push_ringbuf, ssize);
        ASSERT(err == NRF_SUCCESS);
        
        //Immediately free the space where string was put.
        err = nrf_ringbuf_free(&m_log_push_ringbuf, ssize);
        ASSERT(err == NRF_SUCCESS);
        
        return (char const *)p_dst;
    }
    
    else
        return NULL;
}

static inline void std_n(uint32_t           severity_mid,
                         char const *const p_str,
                         uint32_t const    *args,
                         uint32_t           nargs)
{
    uint32_t mask   = m_log_data.mask;
    uint32_t wr_idx;
    
    if(buf_prealloc(nargs, &wr_idx, true))
    {
        // Proceed only if buffer was successfully preallocated.
        
        uint32_t data_idx = wr_idx + HEADER_SIZE;
        uint32_t i;
        
        for(i = 0; i < nargs; i++)
            m_log_data.buffer[data_idx++ & mask] = args[i];
            
        std_header_set(severity_mid, p_str, nargs, wr_idx, mask);
    }
    
    if(m_log_data.autoflush)
        NRF_LOG_FLUSH();
        
}

void nrf_log_frontend_std_0(uint32_t severity_mid, char const *const p_str)
{
    std_n(severity_mid, p_str, NULL, 0);
}


void nrf_log_frontend_std_1(uint32_t            severity_mid,
                            char const *const p_str,
                            uint32_t           val0)
{
    uint32_t args[] = {val0};
    std_n(severity_mid, p_str, args,  ARRAY_SIZE(args));
}


void nrf_log_frontend_std_2(uint32_t           severity_mid,
                            char const *const p_str,
                            uint32_t           val0,
                            uint32_t           val1)
{
    uint32_t args[] = {val0, val1};
    std_n(severity_mid, p_str, args,  ARRAY_SIZE(args));
}


