hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/log/src/nrf_log_frontend.c
                nrf_memobj_write(p_msg_buf, ptr0, len0, memobj_offset);
                memobj_offset += len0;
                
                if(ptr1)
                    nrf_memobj_write(p_msg_buf, ptr1, len1, memobj_offset);
            }
            
            else
            {
                uint8_t *p_data = (uint8_t *)&m_log_data.buffer[rd_idx & mask];
                nrf_memobj_write(p_msg_buf, p_data, data_len, memobj_offset);
            }
            
            rd_idx += CEIL_DIV(orig_data_len, 4);
        }
    }
    
    else if(header.base.generic.type == HEADER_TYPE_STD)  // standard entry
    {
        header.base.std.nargs = MIN(header.base.std.nargs, NRF_LOG_MAX_NUM_OF_ARGS);
        uint32_t msg_buf_size32 = HEADER_SIZE + header.base.std.nargs;
        severity = header.base.std.severity;
        
        p_msg_buf = nrf_memobj_alloc(&log_mempool, msg_buf_size32 * sizeof(uint32_t));
        
        if(p_msg_buf)
        {
            nrf_memobj_get(p_msg_buf);
            nrf_memobj_write(p_msg_buf, &header, HEADER_SIZE * sizeof(uint32_t), memobj_offset);
            memobj_offset += HEADER_SIZE * sizeof(uint32_t);
            
            for(i = 0; i < header.base.std.nargs; i++)
            {
                nrf_memobj_write(p_msg_buf, &m_log_data.buffer[rd_idx++ & mask],
                                 sizeof(uint32_t), memobj_offset);
                memobj_offset += sizeof(uint32_t);
            }
        }
    }
    
    else
    {
        //Do nothing. In case of log overflow buffer can contain corrupted data.
    }
    
    if(p_msg_buf)
    {
        nrf_log_backend_t const *p_backend = m_log_data.p_backend_head;
        
        if(NRF_LOG_ALLOW_OVERFLOW && m_log_data.log_skipped)
        {
            // Check if any log was skipped during log processing. Do not forward log if skipping
            // occured because data may be invalid.
            nrf_memobj_put(p_msg_buf);
        }
        
        else
        {
            while(p_backend)
            {
                bool entry_accepted = false;
                
                if(nrf_log_backend_is_enabled(p_backend) == true)
                {
                    if(NRF_LOG_FILTERS_ENABLED)
                    {
                        uint8_t backend_id = nrf_log_backend_id_get(p_backend);
                        nrf_log_module_filter_data_t *p_module_filter =
                            NRF_LOG_FILTER_SECTION_VARS_GET(header.module_id);
                        uint32_t backend_lvl = BF_GET(p_module_filter->filter_lvls,
                                                      NRF_LOG_LEVEL_BITS,
                                                      (backend_id * NRF_LOG_LEVEL_BITS));
                                                      
                        //Degrade INFO_RAW level to INFO.
                        severity = (severity == NRF_LOG_SEVERITY_INFO_RAW) ?
                                   NRF_LOG_SEVERITY_INFO : severity;
                                   
                        if(backend_lvl >= severity)
                            entry_accepted = true;
                    }
                    
                    else
                    {
                        (void)severity;
                        entry_accepted = true;
                    }
                }
                
                if(entry_accepted)
                    nrf_log_backend_put(p_backend, p_msg_buf);
                    
                p_backend = p_backend->p_cb->p_next;
            }
            
            nrf_memobj_put(p_msg_buf);
            
            if(NRF_LOG_ALLOW_OVERFLOW)
            {
                // Read index can be moved forward only if dequeueing process was not interrupt by
                // skipping procedure. If NRF_LOG_ALLOW_OVERFLOW is set then in case of buffer gets full
                // and new logger entry occurs, oldest entry is removed. In that case read index is
                // changed and updating it here would corrupt the internal circular buffer.
                CRITICAL_REGION_ENTER();
                
                if(m_log_data.log_skipped == 0)
                    m_log_data.rd_idx = rd_idx;
                    
                CRITICAL_REGION_EXIT();
            }
            
            else
                m_log_data.rd_idx = rd_idx;
        }
    }
    
    else
    {
        //Could not allocate memobj - backends are not freeing them on time.
        nrf_log_backend_t const *p_backend = m_log_data.p_backend_head;
        
        //Flush all backends
        while(p_backend)
        {
            nrf_log_backend_flush(p_backend);
            p_backend = p_backend->p_cb->p_next;
        }
        
        NRF_LOG_WARNING("Backends flushed");
    }
    
    return buffer_is_empty() ? false : true;
}

static int32_t backend_id_assign(void)
{
    int32_t candidate_id;
    nrf_log_backend_t const *p_backend;
    bool id_available;
    
    for(candidate_id = 0; candidate_id < NRF_LOG_MAX_BACKENDS; candidate_id++)
    {
        p_backend = m_log_data.p_backend_head;
        id_available = true;
        
        while(p_backend)
        {
            if(nrf_log_backend_id_get(p_backend) == candidate_id)
            {
                id_available = false;
                break;
            }
            
            p_backend = p_backend->p_cb->p_next;
        }
        
        if(id_available)
            return candidate_id;
    }
    
    return -1;
}

int32_t nrf_log_backend_add(nrf_log_backend_t const *p_backend, nrf_log_severity_t severity)
{
    int32_t id = backend_id_assign();
    
    if(id == -1)
        return id;
        
    nrf_log_backend_id_set(p_backend, id);
    
    //add to list
    if(m_log_data.p_backend_head == NULL)
    {
        m_log_data.p_backend_head   = p_backend;
        p_backend->p_cb->p_next = NULL;
    }
    
    else
    {
        p_backend->p_cb->p_next = m_log_data.p_backend_head->p_cb->p_next;
        m_log_data.p_backend_head->p_cb->p_next = p_backend;
    }
    
    if(NRF_LOG_FILTERS_ENABLED)
    {
        uint32_t i;
        
        for(i = 0; i < nrf_log_module_cnt_get(); i++)
        {
            nrf_log_severity_t buildin_lvl = nrf_log_module_init_filter_get(i);
            nrf_log_severity_t actual_severity = MIN(buildin_lvl, severity);
            nrf_log_module_filter_set(nrf_log_backend_id_get(p_backend), i, actual_severity);
        }
    }
    
    return id;
}

void nrf_log_backend_remove(nrf_log_backend_t const *p_backend)
{
    nrf_log_backend_t const *p_curr = m_log_data.p_backend_head;
    nrf_log_backend_t const *p_prev = NULL;
    
    while(p_curr != p_backend)
    {
        p_prev = p_curr;
        p_curr = p_curr->p_cb->p_next;
    }
    
    if(p_prev)
        p_prev->p_cb->p_next = p_backend->p_cb->p_next;
        
    else
        m_log_data.p_backend_head = NULL;
        
    p_backend->p_cb->id = NRF_LOG_BACKEND_INVALID_ID;
}

void nrf_log_panic(void)
{
    nrf_log_backend_t const *p_backend = m_log_data.p_backend_head;
    m_log_data.autoflush = true;
    
    while(p_backend)
    {
        nrf_log_backend_enable(p_backend);
        nrf_log_backend_panic_set(p_backend);
        p_backend = p_backend->p_cb->p_next;
    }
}

#if NRF_MODULE_ENABLED(LOG_CONFIG_LOAD_STORE)
#include "fds.h"
#define LOG_CONFIG_FILE_ID   0x106E
#define LOG_CONFIG_RECORD_ID 0x3427

