hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/log/src/nrf_log_frontend.c
ret_code_t nrf_log_config_store(void)
{
    fds_record_desc_t desc = {0};
    fds_find_token_t  token = {0};
    fds_record_t      record =
    {
        .file_id = LOG_CONFIG_FILE_ID,
        .key     = LOG_CONFIG_RECORD_ID,
        .data = {
            .p_data       = NRF_LOG_FILTER_SECTION_VARS_GET(0),
            .length_words = NRF_SECTION_LENGTH(log_filter_data) / sizeof(uint32_t)
        }
    };
    ret_code_t ret = fds_record_find(LOG_CONFIG_FILE_ID, LOG_CONFIG_RECORD_ID, &desc, &token);
    
    if(ret == FDS_SUCCESS)
    {
        ret = fds_record_update(&desc, &record);
        NRF_LOG_INFO("Logger configuration file updated with result:%d", ret);
    }
    
    else if(ret == FDS_ERR_NOT_FOUND)
    {
        ret = fds_record_write(&desc, &record);
        NRF_LOG_INFO("Logger configuration file written with result:%d", ret);
    }
    
    else
        ret = NRF_ERROR_INTERNAL;
        
    return ret;
}

ret_code_t nrf_log_config_load(void)
{
    fds_record_desc_t desc = {0};
    fds_find_token_t  token = {0};
    
    ret_code_t ret = fds_record_find(LOG_CONFIG_FILE_ID, LOG_CONFIG_RECORD_ID, &desc, &token);
    
    if(ret == FDS_SUCCESS)
    {
        fds_flash_record_t record = {0};
        ret = fds_record_open(&desc, &record);
        
        if(ret == NRF_SUCCESS)
        {
            void *p_dest = (void *)NRF_LOG_FILTER_SECTION_VARS_GET(0);
            uint32_t length   = NRF_SECTION_LENGTH(log_filter_data);
            memcpy(p_dest, record.p_data, length);
            ret = fds_record_close(&desc);
        }
    }
    
    else if(ret == FDS_ERR_NOT_FOUND)
    {
        NRF_LOG_WARNING("Logger configuration file not found.");
        ret = NRF_ERROR_NOT_FOUND;
    }
    
    else
        ret = NRF_ERROR_INTERNAL;
        
    return ret;
}
#endif //LOG_CONFIG_LOAD_STORE_ENABLED

#if NRF_LOG_CLI_CMDS
#include "nrf_cli.h"

typedef void (*nrf_log_cli_backend_cmd_t)(nrf_cli_t const          *p_cli,
                                          nrf_log_backend_t const *p_backend,
                                          size_t                    argc,
                                          char * *                  argv);

static const char *m_severity_lvls[] =
{
    "none",
    "error",
    "warning",
    "info",
    "debug",
};

static const char *m_severity_lvls_sorted[] =
{
    "debug",
    "error",
    "info",
    "none",
    "warning",
};

/**
    @brief Function for finding backend instance with given name.

    @param p_name Name of the backend instance.

    @return Pointer to the instance or NULL.

*/
static nrf_log_backend_t const *backend_find(char const *p_name)
{
    size_t num_of_backends;
    nrf_log_backend_t const *p_backend;
    
    num_of_backends = NRF_SECTION_ITEM_COUNT(NRF_LOG_BACKEND_SECTION_NAME, nrf_log_backend_t);
    
    for(size_t i = 0; i < num_of_backends; i++)
    {
        p_backend = NRF_SECTION_ITEM_GET(NRF_LOG_BACKEND_SECTION_NAME, nrf_log_backend_t, i);
        
        if(strcmp(p_name, p_backend->p_name) == 0)
            return p_backend;
    }
    
    return NULL;
}

/**
    @brief Function for executing command on given backend.
*/
static void nrf_cli_backend_cmd_execute(nrf_cli_t const          *p_cli,
                                        size_t                    argc,
                                        char * *                  argv,
                                        nrf_log_cli_backend_cmd_t func)
{
    //Based on the structure of backend commands, name of the backend can be found at -1 (log backend <name> command).
    char const *p_backend_name = argv[-1];
    
    nrf_log_backend_t const *p_backend = backend_find(p_backend_name);
    
    if(p_backend)
        func(p_cli, p_backend, argc, argv);
        
    else
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "Invalid backend: %s\r\n", p_backend_name);
}


static void log_status(nrf_cli_t const          *p_cli,
                       nrf_log_backend_t const *p_backend,
                       size_t                    argc,
                       char * *                  argv)
{
    UNUSED_PARAMETER(argc);
    UNUSED_PARAMETER(argv);
    
    uint32_t modules_cnt = nrf_log_module_cnt_get();
    uint32_t i;
    
    
    if(!nrf_log_backend_is_enabled(p_backend))
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "Logs are halted!\r\n");
        
    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "%-40s | current | built-in \r\n", "module_name");
    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "----------------------------------------------------------\r\n");
    
    for(i = 0; i < modules_cnt; i++)
    {
        uint32_t backend_id = p_backend->p_cb->id;
        nrf_log_severity_t module_dynamic_lvl =
            nrf_log_module_filter_get(backend_id, i, true, true);
        nrf_log_severity_t module_compiled_lvl =
            nrf_log_module_filter_get(backend_id, i, true, false);
        nrf_log_severity_t actual_compiled_lvl =
            MIN(module_compiled_lvl, (nrf_log_severity_t)NRF_LOG_DEFAULT_LEVEL);
            
        nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "%-40s | %-7s | %s%s\r\n",
                        nrf_log_module_name_get(i, true),
                        m_severity_lvls[module_dynamic_lvl],
                        m_severity_lvls[actual_compiled_lvl],
                        actual_compiled_lvl < module_compiled_lvl ? "*" : "");
    }
}


static void log_self_status(nrf_cli_t const *p_cli, size_t argc, char **argv)
{
    log_status(p_cli, p_cli->p_log_backend, argc, argv);
}


static void log_backend_status(nrf_cli_t const *p_cli, size_t argc, char **argv)
{
    nrf_cli_backend_cmd_execute(p_cli, argc, argv, log_status);
}


static bool module_id_get(const char *p_name, uint32_t *p_id)
{
    uint32_t modules_cnt = nrf_log_module_cnt_get();
    const char *p_tmp_name;
    uint32_t j;
    
    for(j = 0; j < modules_cnt; j++)
    {
        p_tmp_name = nrf_log_module_name_get(j, false);
        
        if(strncmp(p_tmp_name, p_name, 32) == 0)
        {
            *p_id = j;
            break;
        }
    }
    
    return (j != modules_cnt);
}


