hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/log/src/nrf_log_frontend.c
NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_log_backend)
{
    NRF_CLI_CMD(disable, &m_module_name,
                "'log disable <module_0> .. <module_n>' disables logs in specified "
                "modules (all if no modules specified).",
                log_backend_ctrl),
                NRF_CLI_CMD(enable, &m_severity_lvl,
                            "'log enable <level> <module_0> ...  <module_n>' enables logs up to given level in "
                            "specified modules (all if no modules specified).",
                            log_backend_ctrl),
                NRF_CLI_CMD(go, NULL, "Resume logging", log_backend_go),
                NRF_CLI_CMD(halt, NULL, "Halt logging", log_backend_halt),
                NRF_CLI_CMD(status, NULL, "Logger status", log_backend_status),
                NRF_CLI_SUBCMD_SET_END
};

static void backend_name_get(size_t idx, nrf_cli_static_entry_t *p_static)
{
    p_static->handler = NULL;
    p_static->p_help  = NULL;
    p_static->p_subcmd = &m_sub_log_backend;
    p_static->p_syntax  = NULL;
    
    nrf_log_backend_t const *p_backend;
    size_t                    active_idx = 0;
    uint32_t                  i;
    
    for(i = 0; i < NRF_SECTION_ITEM_COUNT(NRF_LOG_BACKEND_SECTION_NAME, nrf_log_backend_t); i++)
    {
        p_backend = NRF_SECTION_ITEM_GET(NRF_LOG_BACKEND_SECTION_NAME, nrf_log_backend_t, i);
        
        if(p_backend->p_cb->id != NRF_LOG_BACKEND_INVALID_ID)
        {
            if(idx == active_idx)
            {
                p_static->p_syntax = p_backend->p_name;
                break;
            }
            
            else
                active_idx++;
        }
    }
}

NRF_CLI_CREATE_DYNAMIC_CMD(m_backend_name_dynamic, backend_name_get);

static void log_config_load_cmd(nrf_cli_t const *p_cli, size_t argc, char **argv)
{
    UNUSED_PARAMETER(argc);
    UNUSED_PARAMETER(argv);
    
    if(nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }
    
    #if LOG_CONFIG_LOAD_STORE_ENABLED
    
    if(nrf_log_config_load() == NRF_SUCCESS)
        nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "Configuration loaded.\r\n");
        
    else
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "Failed to load the configuration.\r\n");
        
    #else
    nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "Not supported.\r\n");
    #endif
}

static void log_config_store_cmd(nrf_cli_t const *p_cli, size_t argc, char **argv)
{
    UNUSED_PARAMETER(argc);
    UNUSED_PARAMETER(argv);
    
    if(nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }
    
    #if LOG_CONFIG_LOAD_STORE_ENABLED
    
    if(nrf_log_config_store() == NRF_SUCCESS)
        nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "Configuration stored.\r\n");
        
    else
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "Failed to store the configuration.\r\n");
        
    #else
    nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "Not supported.\r\n");
    #endif
}

NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_log_config)
{
    NRF_CLI_CMD(load, NULL, "Load configuration stored in non-volatile memory.", log_config_load_cmd),
                NRF_CLI_CMD(store, NULL, "Store current configuration in non-volatile memory.", log_config_store_cmd),
                NRF_CLI_SUBCMD_SET_END
};

NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_log_stat)
{
    NRF_CLI_CMD(backend, &m_backend_name_dynamic, "Logger backends commands.", NULL),
                NRF_CLI_CMD(config, &m_sub_log_config, "Manage logger configuration", NULL),
                NRF_CLI_CMD(disable, &m_module_name,
                            "'log disable <module_0> .. <module_n>' disables logs in specified "
                            "modules (all if no modules specified).",
                            log_self_ctrl),
                NRF_CLI_CMD(enable, &m_severity_lvl,
                            "'log enable <level> <module_0> ...  <module_n>' enables logs up to given level in "
                            "specified modules (all if no modules specified).",
                            log_self_ctrl),
                NRF_CLI_CMD(go, NULL, "Resume logging", log_self_go),
                NRF_CLI_CMD(halt, NULL, "Halt logging", log_self_halt),
                NRF_CLI_CMD(list_backends, NULL, "Lists logger backends.", log_cmd_backends_list),
                NRF_CLI_CMD(status, NULL, "Logger status", log_self_status),
                NRF_CLI_SUBCMD_SET_END
};

static void log_cmd(nrf_cli_t const *p_cli, size_t argc, char **argv)
{
    if((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }
    
    nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s:%s%s\r\n", argv[0], " unknown parameter: ", argv[1]);
}

NRF_CLI_CMD_REGISTER(log, &m_sub_log_stat, "Commands for controlling logger", log_cmd);

#endif //NRF_LOG_CLI_CMDS

#endif // NRF_MODULE_ENABLED(NRF_LOG)
